# -*- coding: utf-8 -*-
token = '679cb7f2d535e1ee14c6e172881b6fd4bd7da23fe78662ed1608cb2ee2f29ef2ae6e56eba0e0475d26fdd'
app_token='xAY7bUlfgfTMqefjvCCR'
confirmation_token = 'a6e6df4b'
gid=93586441
token_ai ='71be22b5d03c44c8b54ee6d84affcda6'
database_name = 'db/inf9gia.db'  # Файл с базой данных
shelve_name = 'db/shelve'  # Файл с хранилищем
ver='1.18 (сборка 10042108_18)'
host_db='us-cdbr-iron-east-05.cleardb.net'
pas_db='b53e6d76632bcb'
user_db='1b86b5a6'
db_name='heroku_d884cf2579769a1'
help_massage=('/game - Начать подготовку к экзамену и выбрать номер задания\n'
    '/python - язык Пайтон (Питон) для задания 9 и 10\n'
    '/schoolalgorithm - Язык КУМИР для задания 9 и 10\n'
    '/pascal - язык Pascal для задания 9 и 10\n'
    '/basic - язык BASIC для задания 9 и 10\n'
    '/help - список команд и немного обо мне )\n'
    '/stat - статистика решения задач\n'
    '/result - общий результат подготовки\n'
    'Я веду подсчет твоей работы. Могу выдать твой уровень подготовки и статистику по заданиям. Так же я слежу за тем, чтобы ты тренировался ежедневно.\n'
    'А еще я понимаю человеческую речь. Попроси меня выдать тебе задание, или помочь с решением, или рассказать о твоих успехах, или показать статистику'
    'Можете со мной говорить на простом языке, я постепенно учусь понимать Вас.')
help_massage_intro=('Бот @gia9_inf_bot версии '+ver+'\n'
    'Предназначен для тренировки навыков умственного труда и алгоритмов решения заданий ГИА по информатике.\n'
    'Отправь команду с номером задания и приступай к решению.\n'
    'Готовый ответ выбираешь из предложенных вариантов или вводишь с клавиатуры.\n'
    'В этой версии я веду подсчет твоей работы. Могу выдать твой уровень подготовки и статистику по заданиям. Так же я слежу за тем, чтобы ты тренировался ежедневно.\n')
debug=1